zst-embedded/STM32L073VZT6-Learning_Projects/projects/TFT-Joystick-SnakeGame/Src/main.cpp
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2017 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32l0xx_hal.h"
#include "spi.h"
#include "gpio.h"

/* USER CODE BEGIN Includes */
#include "stm32l073z_eval.h"
#include "stm32l073z_eval_lcd.h"
#include "snake.hpp"
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
#define SNAKE_LCD_SCALE (16)
#define SNAKE_SPEED_MS (150)

void MyLCD_draw(uint16_t x, uint16_t y, uint16_t color) {
    BSP_LCD_SetTextColor(color);
    BSP_LCD_FillRect(
            x * SNAKE_LCD_SCALE,
            y * SNAKE_LCD_SCALE,
            SNAKE_LCD_SCALE,
            SNAKE_LCD_SCALE);
}

void MyLCD_updateScore(uint16_t score) {
    char buf[50];

    BSP_LCD_SetTextColor(Snake::COLOR_TEXT);
    BSP_LCD_SetBackColor(Snake::COLOR_BORDER);

    BSP_LCD_SetFont(&Font16);
    sprintf(buf, "Score: %d",score);
    BSP_LCD_DisplayStringAt(0, 0, (unsigned char *) buf, LEFT_MODE);
}
/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */
  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */
  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */
  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_SPI1_Init();

  /* USER CODE BEGIN 2 */

  BSP_LED_Init(LED1);
  BSP_LED_Init(LED2);
  BSP_LED_Init(LED3);
  BSP_LED_Init(LED4);

  BSP_JOY_Init(JOY_MODE_GPIO);

  BSP_LCD_Init();
  BSP_LCD_SetTextColor(Snake::COLOR_TEXT);
  BSP_LCD_SetBackColor(Snake::COLOR_BACKGROUND);
  BSP_LCD_SetFont(&Font24);

  BSP_LCD_Clear(Snake::COLOR_BACKGROUND);
  BSP_LCD_DisplayStringAt(0, LINE(3), (unsigned char *) "[SNAKE]", CENTER_MODE);
  BSP_LCD_DisplayStringAt(0, LINE(4), (unsigned char *) "Press any key", CENTER_MODE);
  BSP_LCD_DisplayStringAt(0, LINE(5), (unsigned char *) "to start.", CENTER_MODE);
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  uint32_t ticks = 0;
  while (true) {

      while (BSP_JOY_GetState() == JOY_NONE) {
          HAL_Delay(10);
          // wait until any key is pressed to start
      }

      Snake snake = Snake(
              BSP_LCD_GetXSize() / SNAKE_LCD_SCALE,
              BSP_LCD_GetYSize() / SNAKE_LCD_SCALE,
              &MyLCD_draw,
              &MyLCD_updateScore,
              []() { BSP_LCD_Clear(Snake::COLOR_BACKGROUND); });
      snake.invalidate();

      while (true) {
          //TODO: move to external interrupt
          switch (BSP_JOY_GetState()) {
          case JOY_SEL:
              break;
          case JOY_LEFT:
              snake.setDirection(Snake::DIR_LEFT);
              break;
          case JOY_UP:
              snake.setDirection(Snake::DIR_UP);
              break;
          case JOY_DOWN:
              snake.setDirection(Snake::DIR_DOWN);
              break;
          case JOY_RIGHT:
              snake.setDirection(Snake::DIR_RIGHT);
              break;
          case JOY_NONE:
          default:
              break;
          };
          if (HAL_GetTick() - ticks > SNAKE_SPEED_MS) {
              // BSP_LED_Toggle(LED_ORANGE);
              ticks = HAL_GetTick();
              if (!snake.hasNextMove()) {
                  // lose
                  break;
              }
              snake.move();
          }
      }

      BSP_LCD_SetTextColor(Snake::COLOR_TEXT);
      BSP_LCD_SetBackColor(Snake::COLOR_BACKGROUND);
      BSP_LCD_SetFont(&Font24);
      BSP_LCD_DisplayStringAt(0, LINE(3), (unsigned char *) "You lose!", CENTER_MODE);
      BSP_LCD_DisplayStringAt(0, LINE(4), (unsigned char *) "Press any key", CENTER_MODE);
      BSP_LCD_DisplayStringAt(0, LINE(5), (unsigned char *) "to restart.", CENTER_MODE);
  }
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */
  /* USER CODE END 3 */

}

/** System Clock Configuration
*/
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Configure the main internal regulator output voltage 
    */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = 16;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLLMUL_4;
  RCC_OscInitStruct.PLL.PLLDIV = RCC_PLLDIV_2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_1) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void _Error_Handler(char * file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler_Debug */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
